# 사용자로 입력받은 단어가 아래 fruit 리스트에 포함되어 있는지를 확인하라. 포함되었다면 "정답입니다"를 아닐 경우 "오답입니다" 출력하라.

# fruit = ["사과", "포도", "홍시"]

# 좋아하는 과일은? 사과
# 정답입니다.

 fruit = ["사과", "포도", "홍시"]









# # 답

# a = input("좋아하는 과일은?")

# if a in fruit:
# print("정답입니다.")
# else:
# print("오답입니다.")



# 참고문제
# 아래와 같이 fruit 딕셔너리가 정의되어 있다. 사용자가 입력한 값이 딕셔너리 키 (key) 값에 포함되었다면 "정답입니다"를 아닐 경우 "오답입니다" 출력하라.

# fruit = {"봄" : "딸기", "여름" : "토마토", "가을" : "사과"}

# 제가좋아하는계절은: 봄
# 정답입니다.

# fruit = {"봄" : "딸기", "여름" : "토마토", "가을" : "사과"}

# a = input("제가 제일 좋아하는 계절은:")

# if a in fruit.keys():
# print("정답입니다.")

# else:
# print("오답입니다.")



# 참고문제2
# print(3 => 4)

# 자자 우리가 뭐 비교할 때 "같거나 크다" 보단

# "크거나 같다" 라고 말하는 것 처럼.

# 먼저 >,< 가 먼저 나온 뒤에 "="가 나와야 함.

# 그런데 여기서는 3=>4로 표기하여 오류가 낫다고 할 수 있습니다용~!